/*>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
* 文件名  ： main
* 作者    ：万粤黔
* 版本    ： V1.0.0
* 时间    ： 2020-10-05
* 简要    ： main文件  
********************************************************************
* 副本
*
*>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>*/
/* 头文件 ----------------------------------------------------------------*/
#include "ioCC2530.h" 
#include "led.h"
#include "key.h"
#define LED1 P1_0     // P1_0定义为P1.0
#define LED2 P1_1     // P1_1定义为P1.1

/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
* 函数名：DelayMs
* 参数：UINT time
* 返回：void
* 作者：万粤黔
* 描述：延时函数
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*/
unsigned int temp = 0;//1ms精确定时
void DelayMs(unsigned int time)
{
    unsigned int i = 0;
    unsigned int j;
    for(i = 0; i < time; i++)
    {
        for(j = 0; j < 475; j++)
        {         asm("NOP");   
        asm("NOP");
        asm("NOP");
        }
    }
}
/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
* 函数名：main
* 参数：void
* 返回：void
* 描述：主函数/入口函数
* 作者：万粤黔
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*/
void main(void)
{
    LedInt();
    KeyInit();
    LedOff(LED_ALL_E);
    while(1)
    {
        if(KEY_PRESS == KeyStateGet(KEY_KEY1_E))
        {
            DelayMs(100);
            if(KEY_PRESS == KeyStateGet(KEY_KEY1_E))
            {
                LedToggle(LED_LED1_E);
        }
        while(KEY_PRESS == KeyStateGet(KEY_KEY1_E));
    }
}
}